### IT规划中的技术体系架构   
体系架构通常会建立一个共有的远景，然而，简单的设定远景是远远不够的，必须和构建人员、客户、其他相关人员进行沟通以达成共识，在构建过程中要维护该体系架构。它在一个横跨于客户需求、构建人员的要求以及客观世界约束的沟壑之间架构了一座桥梁。   

**什么是体系架构？**   

体系架构可以定义为一种使用的、有条理的部件集合的结构化形式，该架构通过这些部件以一种精确的方式为用户提供远景的支持。IT行业使用“体系架构”这一概念的历史不是很长，它同其他行业在体系结构使用方法上有相同的应用前景，体系架构的实现连接了具体的需求和远景的战略规划。

从IT规划角度看，企业IT体系架构往往和软件系统架构、应用程序架构混为一谈，确切讲，企业IT体系架构的概念比软件系统架构的概念更宽泛，它指明了通过IT系统支持业务目标的方向。按照这种使用体系结构技术的组织可以满足许多关键IT原则：         

 1. 对于业务系统和IT系统的管理可以帮助实现业务目标；          
 2. 在业务目标和信息需求的一致说明的基础上，就业务系统优先级和相互依赖性作决策；          
 3. 快速灵活的实施新系统、改进系统以及获取支持业务创新的信息；         
 4. 技术的发展和采用受到业务优先权的影响。   

企业IT体系架构包括了体系架构化准则的层次结构：          
 
 1. 信息体系结构：信息体系结构设计组织信息的结构和用途，根据组织的战略、战术和运营方面的要求对信息加以调整。          
 2. 业务系统体系结构：根据必需的业务系统，业务系统体系结构指导对信息结构化处理以满足业务系统的要求。          
 3. 技术体系结构：技术体系结构定义了整个信息系统中的技术环境和基础结构。         
 4.软件体系结构或应用程序体系结构：它们定义了基于所定义的技术的单个系统的“结构”。   

**技术体系架构的重要性**   

在企业IT体系架构中，最关键的一个部分是技术体系架构。之所以技术体系架构重要是因为它对IT规划的实现起着支撑作用。从本质上讲，技术体系架构定义了组织为了获得商业利润而构建与使用的信息技术平台。        
技术体系架构包含如下内容：         

 1. 描述和定义了所交付业务系统所采用的技术环境的结构；        
 2. 建立和维护一套评价技术项目的核心技术标准；         
 3. 建立了技术与业务系统有机结合的一个行之有效的方法；        
 4. 建立技术实现决策的框架；         
 5. 为组织的技术环境保持良好的发展态势提供管理理架构。   

技术体系架构并不仅仅是一套标准，确切讲，它是一种组织能力的体现，这种能力不仅体现在文档方面，还反映了技术专家、IT管理员、规划、设计人员以及实施人员的知识与经验。

从总体展望一下，可以看到技术体系架构可能为企业带来的优势：       

**一、更为行之有效的IT运营方式**              
定义良好的结构和具体IT实现的模块化结构可以导致更加行之有效的IT运维方式：            

1. 较低的软件开发、支持和维护费用；            
2. 更好的应用程序可移植性；             
3. 改进的互操作性、更简单的系统和网络管理方式；            
4. 可以跟高的解决诸如安全性之类的企业关键问题；            
5. 系统组件的更新与更换更方便。        

**二、现有投资的更大回报与未来投资的更低风险**               
现有的和已经规划的系统结构定义清晰，会产生如下效果：             

1. 减少IT基础结构的复杂性；              
2. 使得现有IT基础结构投资产生最大的回报；             
3. 增加了制作和购买IT解决方案的灵活性；             
4. 降低了IT所有权费用和新投资的风险。        

**三、更为廉价便捷的采购方式**               
技术体系架构对未来的采购和移植有完整的策略，其产生的结构是：             
1. 采购决策更为简单，可以更方便的利用在一致的规划中的采购信息；             
2. 采购过程更快、最大化采购速度和采购灵活性而不会破坏体系架构的移植性。        

**四、业务增长和结构重组的灵活性**               
定义良好的技术体系架构可以确保更为方便的跨企业访问集成信息：              

1. 业务增长和结构重组的最大灵活性；               
2. 通过内部合并、兼并和重新设计业务流程以节约实际成本。       

**五、加速进入市场的时间**             
构建良好的IT基础架构可以更快的开发以任务为中心的业务应用程序：            

1. 新产品和服务进入市场的时间加快；            
2. 扩大发展规模和盈利能力。
